5_Gossip/Gossip_Project_3/app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips"
---
      <div class="row row-cols-4 d-flex justify-content-center">
        <% Gossip.all.each do |gossip| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 123]]
---
              <h4 class="card-text"><%= gossip.title %></h4>
              <h5 class="card-title">de : <%= link_to gossip.user.first_name, user_path(gossip.user.id) %></h5>
              <span class="badge badge-pill badge-secondary"> <%= gossip.comments.length %> Commentaires</span>