5_Gossip/Gossip_Project_3/app/views/gossips/new.html.erb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      <br />
     <input type="hidden" name="user" value=<%= User.first.id %>>