5_Gossip/Gossip_Project_3/app/views/gossips/show.html.erb

          <h5> <span class="card-author">Auteur</span> :
          <%= link_to @current_gossip.user.first_name, user_path(@current_gossip.user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]