5_Gossip/Gossip_Project_3/app/controllers/cities_controller.rb

  def show
    @current_city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 76], ["LIMIT", 1]]