5_Gossip/Gossip_Project_3/app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 123], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 123]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Je veux tester les commentaires"], ["user_id", 81], ["gossip_id", 123], ["created_at", "2020-05-06 13:49:34.843026"], ["updated_at", "2020-05-06 13:49:34.843026"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 81], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 99], ["LIMIT", 1]]
SELECT "join_table_gossip_tags".* FROM "join_table_gossip_tags"
---
  def create

    @current_gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.create(content: params[:content], user_id: User.first.id, gossip_id: @current_gossip.id)
    @tags = JoinTableGossipTag.all.map{|join| join.gossip_id == @current_gossip.id ? join.tag.title : nil}.compact

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 123], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def edit
    @current_gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 123], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 99], ["LIMIT", 1]]
SELECT "join_table_gossip_tags".* FROM "join_table_gossip_tags"
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "?Kill my boss? Do I dare live out the American dream??"], ["updated_at", "2020-05-06 15:02:48.074706"], ["id", 13]]
---
  def update
    @current_gossip = Gossip.find(params[:gossip_id])
    @tags = JoinTableGossipTag.all.map{|join| join.gossip_id == @current_gossip.id ? join.tag.title : nil}.compact
    @comment = Comment.find(params[:id])

    if @comment.update(content: params[:content])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 123], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 99], ["LIMIT", 1]]
SELECT "join_table_gossip_tags".* FROM "join_table_gossip_tags"
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 83], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 83]]
---
  def destroy
    @current_gossip = Gossip.find(params[:gossip_id])
    @tags = JoinTableGossipTag.all.map{|join| join.gossip_id == @current_gossip.id ? join.tag.title : nil}.compact
    @comment = Comment.find(params[:id])

    if @comment.destroy