5_Gossip/Gossip_Project_3/app/controllers/gossips_controller.rb

  def show
    @current_gossip = Gossip.find(params[:id])
    @comment = Comment.new
    @tags = JoinTableGossipTag.all.map{|join| join.gossip_id == @current_gossip.id ? join.tag.title : nil}.compact
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 99], ["LIMIT", 1]]
SELECT "join_table_gossip_tags".* FROM "join_table_gossip_tags"

  def new
    @gossip = Gossip.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: params[:user])
    @tags = JoinTableGossipTag.new(gossip_id: @gossip.id, tag_id: params[:tag])

    if @gossip.save && params[:tag] != ""
      @tag = JoinTableGossipTag.create(tag_id: Tag.find(params[:tag]).id, gossip_id: @gossip.id)
---
INSERT INTO "join_table_gossip_tags" ("gossip_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["gossip_id", 158], ["tag_id", 96], ["created_at", "2020-05-06 15:59:46.234580"], ["updated_at", "2020-05-06 15:59:46.234580"]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Zidane"], ["content", "Le lourdo"], ["user_id", 81], ["created_at", "2020-05-06 15:50:41.787428"], ["updated_at", "2020-05-06 15:50:41.787428"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 81], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 158], ["LIMIT", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 96], ["LIMIT", 1]]

  def edit
    @current_gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]

  def update
    @current_gossip = Gossip.find(params[:id])

    if @current_gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 57], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["content", "Do they find thoughts in our butts??"], ["updated_at", "2020-05-06 12:19:59.238167"], ["id", 90]]

  def destroy
    @current_gossip = Gossip.find(params[:id])
    @current_gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 158], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 158]]