5_Gossip/Gossip_Project_3/app/controllers/users_controller.rb

  def show
    @current_user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 90], ["LIMIT", 1]]