5_Gossip/Gossip_Project_3/app/views/comments/_index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 123]]
---
      <% @current_gossip.comments.each do |comment|%>

INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Je veux tester les commentaires"], ["user_id", 81], ["gossip_id", 123], ["created_at", "2020-05-06 13:52:01.039458"], ["updated_at", "2020-05-06 13:52:01.039458"]]
---
            <h5 class="card-title text-success"><%= comment.user.entire_name%></h5>
            <h6 class="card-subtitle mb-2 text-muted"><%= comment.created_at.strftime("%d %b %Y à %H:%M") %></h6>